exp_3_node/logs5/lr_25_app3_25rps_wrk.log
Running 30s test @ http://10.97.105.44/?loopCount=25&base=6&exp=6
  1 threads and 1 connections

  Thread calibration: mean lat.: 100.076ms, rate sampling interval: 293ms

-----------------------------------------------------------------------
Test Results @ http://10.97.105.44/?loopCount=25&base=6&exp=6 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   211.28ms   40.86ms 293.12ms   64.52%
    Req/Sec    24.06      1.76    27.00     73.53%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  199.42ms
 75.000%  245.89ms
 90.000%  274.43ms
 99.000%  293.12ms
 99.900%  296.19ms
 99.990%  296.19ms
 99.999%  296.19ms
100.000%  296.19ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     141.311     0.000000            1         1.00
     162.047     0.100000           50         1.11
     176.767     0.200000          100         1.25
     185.471     0.300000          150         1.43
     192.127     0.400000          200         1.67
     199.423     0.500000          248         2.00
     204.159     0.550000          273         2.22
     215.039     0.600000          298         2.50
     225.791     0.650000          323         2.86
     238.847     0.700000          348         3.33
     245.887     0.750000          372         4.00
     248.703     0.775000          385         4.44
     252.031     0.800000          397         5.00
     256.383     0.825000          411         5.71
     264.959     0.850000          423         6.67
     269.311     0.875000          434         8.00
     272.383     0.887500          443         8.89
     275.455     0.900000          447        10.00
     276.223     0.912500          453        11.43
     279.551     0.925000          459        13.33
     280.575     0.937500          465        16.00
     283.647     0.943750          469        17.78
     285.183     0.950000          473        20.00
     285.695     0.956250          476        22.86
     286.719     0.962500          479        26.67
     289.535     0.968750          481        32.00
     290.815     0.971875          483        35.56
     291.071     0.975000          485        40.00
     291.839     0.978125          486        45.71
     292.351     0.981250          489        53.33
     292.351     0.984375          489        64.00
     293.119     0.985938          491        71.11
     293.119     0.987500          491        80.00
     293.119     0.989062          491        91.43
     293.375     0.990625          492       106.67
     293.887     0.992188          493       128.00
     293.887     0.992969          493       142.22
     293.887     0.993750          493       160.00
     294.655     0.994531          494       182.86
     294.655     0.995313          494       213.33
     295.167     0.996094          495       256.00
     295.167     0.996484          495       284.44
     295.167     0.996875          495       320.00
     295.167     0.997266          495       365.71
     295.167     0.997656          495       426.67
     296.191     0.998047          496       512.00
     296.191     1.000000          496          inf
#[Mean    =      211.280, StdDeviation   =       40.862]
#[Max     =      295.936, Total count    =          496]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  742 requests in 30.00s, 226.08KB read
Requests/sec:     24.73  
Transfer/sec:      7.54KB