exp_3_node/logs5/lr_26_app2_50rps_wrk.log
Running 30s test @ http://10.99.189.79/?loopCount=25&base=6&exp=6
  5 threads and 5 connections

  Thread calibration: mean lat.: 414.589ms, rate sampling interval: 1796ms
  Thread calibration: mean lat.: 384.723ms, rate sampling interval: 1243ms
  Thread calibration: mean lat.: 502.163ms, rate sampling interval: 1553ms
  Thread calibration: mean lat.: 575.440ms, rate sampling interval: 2072ms
  Thread calibration: mean lat.: 405.364ms, rate sampling interval: 1190ms

-----------------------------------------------------------------------
Test Results @ http://10.99.189.79/?loopCount=25&base=6&exp=6 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.52s   603.46ms   2.74s    60.06%
    Req/Sec     8.94      1.26    12.00     96.88%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.52s 
 75.000%    2.02s 
 90.000%    2.34s 
 99.000%    2.74s 
 99.900%    2.77s 
 99.990%    2.80s 
 99.999%    2.80s 
100.000%    2.80s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     181.503     0.000000            1         1.00
     712.703     0.100000           94         1.11
     905.215     0.200000          188         1.25
    1103.871     0.300000          283         1.43
    1306.623     0.400000          377         1.67
    1524.735     0.500000          470         2.00
    1599.487     0.550000          518         2.22
    1668.095     0.600000          567         2.50
    1767.423     0.650000          611         2.86
    1943.551     0.700000          658         3.33
    2021.375     0.750000          705         4.00
    2069.503     0.775000          729         4.44
    2117.631     0.800000          752         5.00
    2195.455     0.825000          776         5.71
    2248.703     0.850000          799         6.67
    2297.855     0.875000          822         8.00
    2320.383     0.887500          835         8.89
    2340.863     0.900000          847        10.00
    2351.103     0.912500          857        11.43
    2369.535     0.925000          870        13.33
    2402.303     0.937500          884        16.00
    2406.399     0.943750          889        17.78
    2422.783     0.950000          893        20.00
    2447.359     0.956250          899        22.86
    2508.799     0.962500          904        26.67
    2617.343     0.968750          910        32.00
    2646.015     0.971875          913        35.56
    2668.543     0.975000          916        40.00
    2680.831     0.978125          919        45.71
    2711.551     0.981250          923        53.33
    2715.647     0.984375          926        64.00
    2715.647     0.985938          926        71.11
    2721.791     0.987500          928        80.00
    2729.983     0.989062          929        91.43
    2740.223     0.990625          931       106.67
    2742.271     0.992188          932       128.00
    2746.367     0.992969          935       142.22
    2746.367     0.993750          935       160.00
    2746.367     0.994531          935       182.86
    2746.367     0.995313          935       213.33
    2752.511     0.996094          937       256.00
    2752.511     0.996484          937       284.44
    2752.511     0.996875          937       320.00
    2752.511     0.997266          937       365.71
    2752.511     0.997656          937       426.67
    2768.895     0.998047          938       512.00
    2768.895     0.998242          938       568.89
    2768.895     0.998437          938       640.00
    2768.895     0.998633          938       731.43
    2768.895     0.998828          938       853.33
    2797.567     0.999023          939      1024.00
    2797.567     1.000000          939          inf
#[Mean    =     1519.719, StdDeviation   =      603.457]
#[Max     =     2795.520, Total count    =          939]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  1395 requests in 30.00s, 425.70KB read
Requests/sec:     46.50  
Transfer/sec:     14.19KB