exp_3_node/logs5/mplb_26_app3_25rps_wrk.log
Running 30s test @ http://10.99.189.79/?loopCount=25&base=6&exp=6
  1 threads and 1 connections

  Thread calibration: mean lat.: 3335.638ms, rate sampling interval: 11321ms

-----------------------------------------------------------------------
Test Results @ http://10.99.189.79/?loopCount=25&base=6&exp=6 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    12.50s     3.41s   18.10s    55.94%
    Req/Sec     9.00      0.00     9.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   12.77s 
 75.000%   15.42s 
 90.000%   17.04s 
 99.000%   18.10s 
 99.900%   18.24s 
 99.990%   18.24s 
 99.999%   18.24s 
100.000%   18.24s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    6356.991     0.000000            1         1.00
    7573.503     0.100000           21         1.11
    8773.631     0.200000           41         1.25
   10354.687     0.300000           61         1.43
   11558.911     0.400000           81         1.67
   12771.327     0.500000          101         2.00
   13369.343     0.550000          115         2.22
   13639.679     0.600000          122         2.50
   14139.391     0.650000          132         2.86
   14745.599     0.700000          142         3.33
   15417.343     0.750000          152         4.00
   15736.831     0.775000          157         4.44
   16113.663     0.800000          162         5.00
   16244.735     0.825000          167         5.71
   16539.647     0.850000          172         6.67
   16826.367     0.875000          177         8.00
   17006.591     0.887500          181         8.89
   17039.359     0.900000          182        10.00
   17137.663     0.912500          185        11.43
   17334.271     0.925000          187        13.33
   17432.575     0.937500          190        16.00
   17481.727     0.943750          191        17.78
   17629.183     0.950000          192        20.00
   17760.255     0.956250          194        22.86
   17809.407     0.962500          195        26.67
   17874.943     0.968750          196        32.00
   17940.479     0.971875          197        35.56
   17940.479     0.975000          197        40.00
   18006.015     0.978125          198        45.71
   18055.167     0.981250          199        53.33
   18055.167     0.984375          199        64.00
   18104.319     0.985938          200        71.11
   18104.319     0.987500          200        80.00
   18104.319     0.989062          200        91.43
   18169.855     0.990625          201       106.67
   18169.855     0.992188          201       128.00
   18169.855     0.992969          201       142.22
   18169.855     0.993750          201       160.00
   18169.855     0.994531          201       182.86
   18235.391     0.995313          202       213.33
   18235.391     1.000000          202          inf
#[Mean    =    12502.158, StdDeviation   =     3408.298]
#[Max     =    18219.008, Total count    =          202]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  293 requests in 30.00s, 89.41KB read
Requests/sec:      9.77  
Transfer/sec:      2.98KB