exp_3_node/logs5/mplb_4_app2_50rps_wrk.log
Running 30s test @ http://10.102.95.213/?loopCount=25&base=6&exp=6
  5 threads and 5 connections

  Thread calibration: mean lat.: 63.804ms, rate sampling interval: 298ms
  Thread calibration: mean lat.: 60.729ms, rate sampling interval: 228ms
  Thread calibration: mean lat.: 59.046ms, rate sampling interval: 197ms
  Thread calibration: mean lat.: 70.119ms, rate sampling interval: 302ms
  Thread calibration: mean lat.: 74.449ms, rate sampling interval: 314ms

-----------------------------------------------------------------------
Test Results @ http://10.102.95.213/?loopCount=25&base=6&exp=6 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    47.48ms   20.94ms 151.04ms   89.30%
    Req/Sec     9.56      1.78    15.00     85.94%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   41.53ms
 75.000%   42.75ms
 90.000%   66.05ms
 99.000%  151.04ms
 99.900%  164.99ms
 99.990%  165.25ms
 99.999%  165.25ms
100.000%  165.25ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      22.335     0.000000            1         1.00
      38.815     0.100000          100         1.11
      40.639     0.200000          208         1.25
      40.863     0.300000          300         1.43
      41.183     0.400000          404         1.67
      41.535     0.500000          502         2.00
      41.759     0.550000          551         2.22
      41.951     0.600000          603         2.50
      42.143     0.650000          651         2.86
      42.399     0.700000          701         3.33
      42.751     0.750000          752         4.00
      43.007     0.775000          776         4.44
      43.551     0.800000          800         5.00
      44.991     0.825000          825         5.71
      46.719     0.850000          851         6.67
      53.471     0.875000          875         8.00
      56.191     0.887500          888         8.89
      66.047     0.900000          900        10.00
      69.823     0.912500          913        11.43
      77.503     0.925000          925        13.33
      84.927     0.937500          939        16.00
      85.503     0.943750          944        17.78
      87.103     0.950000          950        20.00
      90.175     0.956250          957        22.86
      91.775     0.962500          963        26.67
      94.591     0.968750          970        32.00
      97.791     0.971875          972        35.56
     149.247     0.975000          977        40.00
     149.375     0.978125          979        45.71
     149.631     0.981250          984        53.33
     149.887     0.984375          986        64.00
     149.887     0.985938          986        71.11
     150.399     0.987500          988        80.00
     151.039     0.989062          990        91.43
     151.167     0.990625          992       106.67
     151.295     0.992188          993       128.00
     151.295     0.992969          993       142.22
     151.423     0.993750          994       160.00
     153.727     0.994531          995       182.86
     155.263     0.995313          996       213.33
     157.567     0.996094          998       256.00
     157.567     0.996484          998       284.44
     157.567     0.996875          998       320.00
     157.567     0.997266          998       365.71
     157.567     0.997656          998       426.67
     164.991     0.998047          999       512.00
     164.991     0.998242          999       568.89
     164.991     0.998437          999       640.00
     164.991     0.998633          999       731.43
     164.991     0.998828          999       853.33
     165.247     0.999023         1000      1024.00
     165.247     1.000000         1000          inf
#[Mean    =       47.484, StdDeviation   =       20.942]
#[Max     =      165.120, Total count    =         1000]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  1495 requests in 30.00s, 455.59KB read
Requests/sec:     49.83  
Transfer/sec:     15.18KB